---
  title: '自律和自制力'
date: 2022-03-23
permalink:/posts/2022/03/blog03232022/
  tags:
  - Diary
- PhD
- 2022
---
  
最近算是发现了，自制力强不一定意味着在诱惑面前能不为所动——坐怀不乱很厉害，但对于大部分人来说不适用，毕竟人总有七情六欲。这就恰恰说明了真正自律的人不是靠自制力约束自己的，而往往是通过选择和习惯使自己看上去足够自律。

1. 选择：了解人性的弱点，知道自己会在满是零食的房间不停地吃东西而不去学习，知道自己在寝室会不自觉玩手机玩平板，知道自己经受不住朋友的鼓动会在重要的deadline来临之前出去玩，那么，自律就需要你为自己选择一个能很好地切断这些干扰源的环境，在这个环境中你可以不用为难自己拒绝诱惑，你不需要花费很多精力去阻止自己做不自律的事，你不需要在自律这件事情上花费太多精力。这个环境，可以是学校的自习室，可以是图书馆，可以是一家比较安静的咖啡厅，总之这个坏境里，必须没有那些你认为自己抵挡不了的诱惑。这个环境在很大程度上成为了你保持自律的前提。

2. 习惯：很多时候，我们会惊叹于那些自律的人能坚持做一件事，这件事往往对其他人来说非常难，大部分人都三分钟热度或者三天打鱼两天晒网。其实如果能长期坚持做一件事，无非需要两个条件：提高动力，降低阻力。
提高动力往往是心态方面的问题，找到自己的目标和热情所在，就能很大程度上增大动力。但问题在于，一鼓作气，再而衰，三而竭，人总是会信誓旦旦地开始，然后往往是无所事事地不了了之。所以降低阻力，才是长期坚持的关键。
养成习惯无疑是降低阻力的最好方法，因为人类的习得性将导致当你习惯性做一件事，养成了固定的行为方式后，那么你的大脑将把这种行为方式作为潜意识里的comfortable zone里的选择，你做这件事情的阻力往往降低很多。
比如说在坚持健身5年后，习惯促使我如果不去健身，就会潜意识里觉得生活缺点什么，潜意识想要去做这件事。以及背单词，坚持了三年之后，我每天如果想到今天的单词还没背，哪怕困成狗屎早睡不了我也一定会去背而不是拖延着不背。

哪有什么自制力异于常人，哪有什么总是很自律，成功的人不过是谨慎选择环境和交往对象，并且有意识地将耗费精力的事培养成阻力小的习惯罢了。